/*
题目大意：
小女孩丹妮娅爬上一栋多层建筑的楼梯。每次丹妮娅爬楼梯时，她都会数着从1点到台阶的台阶数。她大声说出每一个数字。例如，如果她爬两个楼梯，其中第一个楼梯包含3个3个台阶，第二个楼梯包含4个4个台阶，她会发出数字1, 2, 3、1, 2, 3、4、1、2、3、1、2、3、4。
你得到了丹妮娅所说的所有数字。她爬了几级楼梯？另外，输出每个楼梯的台阶数。
给定的序列将是一个有效的序列，丹妮娅可以在攀登一个或多个楼梯时发音。
输入格式：
第一行包含n(1≤n≤1000)丹妮娅所表示的数字的总数。
第二行包含整数a_1, a_2, \dots, a_n a
1
​	 ,a
2
​	 ,…,a
n
​	  ( 1 \le a_i \le 1000 1≤a
i
​	 ≤1000 ) 。
一
A，A
二
a，a，a
n
（1）A1 Ile LE 1000 1±A
我
小于1000）所有的数字Tyya在爬楼梯时发音，从第一个到最后一个明显的数字。通过一个带X步的楼梯，她会按顺序说出数字1, 2、点、X、1、2、…、X。
给定的序列将是一个有效的序列，丹妮娅可以在攀登一个或多个楼梯时发音。
*/
#
